In [2]:
import pandas as pd
import numpy as np

处理缺失数据
用np.nan表示
用isnull(),notnull()检测出来
用fillna填充
dropna将缺失数据去掉

In [2]:
string_data=pd.Series(['a','b',np.nan,'c'])
string_data

0      a
1      b
2    NaN
3      c
dtype: object

In [3]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
string_data.fillna(0)

0    a
1    b
2    0
3    c
dtype: object

In [5]:
string_data.dropna()

0    a
1    b
3    c
dtype: object

In [7]:
string_data.notnull()

0     True
1     True
2    False
3     True
dtype: bool

In [8]:
from numpy import nan as NA

In [9]:
data=pd.Series([1,NA,3.5,NA,7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
data[data.notna()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [11]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

DataFrame.dropna()默认丢弃全NA或含有NA的行
how='all'丢弃全为NA的行
axis=1丢弃列

In [15]:
data=pd.DataFrame([[1.,6.5,3.],[1.,NA,NA],[NA,NA,NA],[NA,6.5,3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [16]:
cleaned=data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

In [17]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [18]:
data.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [23]:
data['4']=NA
print(data)
data.dropna(how='all',axis=1)

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

thresh=n丢弃前n行含有NA的项

In [27]:
df=pd.DataFrame(np.random.randn(7,3))
df

          0         1         2
0 -0.004964 -0.324502 -0.722597
1 -0.210958 -0.162858  1.424785
2 -0.764837 -0.835201 -0.265675
3 -0.010320  1.040663 -0.245180
4 -1.815801 -1.984084  2.250559
5 -0.040651 -0.231178 -0.289700
6  0.431323 -2.140905  0.858885

In [28]:
df.iloc[:4,1]=NA

In [29]:
df

          0         1         2
0 -0.004964       NaN -0.722597
1 -0.210958       NaN  1.424785
2 -0.764837       NaN -0.265675
3 -0.010320       NaN -0.245180
4 -1.815801 -1.984084  2.250559
5 -0.040651 -0.231178 -0.289700
6  0.431323 -2.140905  0.858885

fillna填充NA

In [30]:
df.fillna(0)

          0         1         2
0 -0.004964  0.000000 -0.722597
1 -0.210958  0.000000  1.424785
2 -0.764837  0.000000 -0.265675
3 -0.010320  0.000000 -0.245180
4 -1.815801 -1.984084  2.250559
5 -0.040651 -0.231178 -0.289700
6  0.431323 -2.140905  0.858885

In [31]:
df.fillna({1:0.5,2:0})

          0         1         2
0 -0.004964  0.500000 -0.722597
1 -0.210958  0.500000  1.424785
2 -0.764837  0.500000 -0.265675
3 -0.010320  0.500000 -0.245180
4 -1.815801 -1.984084  2.250559
5 -0.040651 -0.231178 -0.289700
6  0.431323 -2.140905  0.858885

In [32]:
_=df.fillna(0,inplace=True)

In [33]:
df

          0         1         2
0 -0.004964  0.000000 -0.722597
1 -0.210958  0.000000  1.424785
2 -0.764837  0.000000 -0.265675
3 -0.010320  0.000000 -0.245180
4 -1.815801 -1.984084  2.250559
5 -0.040651 -0.231178 -0.289700
6  0.431323 -2.140905  0.858885

In [34]:
df=pd.DataFrame(np.random.randn(6,3))
df.iloc[2:,1]=NA
df.iloc[4:,2]=NA
df

          0         1         2
0  0.336005 -0.631722  1.480747
1 -0.975423 -1.149804  0.115033
2 -0.911061       NaN  0.401263
3 -0.054444       NaN  0.265035
4  0.331361       NaN       NaN
5  2.364219       NaN       NaN

插值填充：ffill
中位数、平均值可以用data.midian(),data.mean()

In [39]:
df.fillna(method='ffill',limit=2)

          0         1         2
0  0.336005 -0.631722  1.480747
1 -0.975423 -1.149804  0.115033
2 -0.911061 -1.149804  0.401263
3 -0.054444 -1.149804  0.265035
4  0.331361       NaN  0.265035
5  2.364219       NaN  0.265035

In [40]:
data=pd.Series([1.,NA,3.5,NA,7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [41]:
data.fillna(data.median())

0    1.0
1    3.5
2    3.5
3    3.5
4    7.0
dtype: float64

去重
移除重复数据
DataFrame.duplicated()判断是否重复
DataFrame.drop_duplicates()丢弃重复

In [4]:
data=pd.DataFrame({'k1':['one','two']*3+['two'],'k2':[1,1,2,3,3,4,4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [5]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [3]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [7]:
data['v1']=range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

duplicate,drop_duplicate默认保留第一个出现的值的组合，keep='last'保留最后一个

In [8]:
data.drop_duplicates(['k1','k2'],keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

替换值
DataFrame.replace()

In [3]:
data=pd.Series([1.,-999.,2.,-999.,-1000.,3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [10]:
data.replace(-999.,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [11]:
#一次替换多个值
data.replace([-999.,-1000.],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [4]:
#传入字典，进行针对性替换
data.replace({-1000:np.nan,-999:0})

0    1.0
1    0.0
2    2.0
3    0.0
4    NaN
5    3.0
dtype: float64

In [5]:
data=pd.DataFrame(np.arange(12).reshape((3,4)),index=['Ohio','Colorado','New York'],columns=['one','two','three','four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [8]:
#map传递lambda表达式
transform=lambda x:x[:4].upper()
print(data.index.map(transform))
data.index=data.index.map(transform)
data

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [9]:
data.rename(index=str.title,columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [16]:
#用字典更新部分轴标签（不改变原本的数据）
data.rename(index={'OHIO':'INDIANA'},columns={'three':'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [17]:
#inplace=True 改变原本的数据
data.rename(index={'OHIO':'INDIANA'},columns={'three':'peekaboo'},inplace=True)
data

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

离散化

In [18]:
ages=[20,22,25,27,21,23,37,31,61,45,41,32]
bins=[18,25,35,60,100]
cats=pd.cut(ages,bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [19]:
data=pd.DataFrame(np.random.randn(1000,4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.050186    -0.011646    -0.024800    -0.031182
std       0.993394     1.016066     0.984020     0.981199
min      -3.075891    -3.306410    -3.400972    -3.696753
25%      -0.650816    -0.692116    -0.690445    -0.688747
50%       0.046521     0.003913     0.000854    -0.042631
75%       0.712884     0.698175     0.653018     0.600681
max       3.586710     3.030177     3.259678     3.425582